[
    {
        "id": "intro",
        "section": "intro",
        "title": "WX-78",
        "subtitle": "The Soulless Automaton... or maybe not?",
        "text": "Ah, my very dear WX-78: the soulless automaton and local self proclaimed \"ruthless killing machine\" of the Don't Starve universe. My personal top #2 favorite character (only surpassed by Webber for a mere inch) and my current main in-game.<br><br>What is there for me not to like about WX-78? They're a robot, they're canonically non binary (which is a really funny thing to me if we see this from a programming/coding point of view- robots usually have binary code integrated in their programming and yet WX is non binary. One could say they operate on non-binary code. Haha.), they use exclusively they/them pronouns (I wish that was me), and specially they're cold, ruthless and emotionless. Truly the pinnacle of perfection- the perfect yet dystopian image of the scientist who rejects the weakness of their own flesh and emotions to become a machine driven by nothing nbut logic (and perhaps violence in WX-78's case).<br><br>... Or so the trope they're based on wants us to believe.<br><br>Is WX-78 truly a soulless automaton, or a broken human soul hiding behind a metal shell, afraid of their own emotions?<br><br>Let us see what's this robot's deal in this character analysis that I bring you!",
        "quote": "EMPATHY MODULE NOT RESPONDING",
        "theme": "dark",
        "alignment": "center"
    },
    {
        "id": "origin",
        "section": "origin",
        "title": "Who are they?:\nWX-78's origins",
        "text": "The first thing we ought to know is that WX-78 was not always the automaton we know (and love) today. We get to learn this in the official animated short, <a href='https://www.youtube.com/watch?v=UDfzBh_p2YM&pp=ugMICgJlcxABGAHKBQ53eC03OCBhbmltYXRpYw%3D%3D' style='color: #bb8354; text-decoration: underline;' target='_blank'>\"Disconnected\"</a> after Winona fixes WX-78's Empathy Module (an object that we see inside the automaton's mechanisms which looks like a heart) and awakes an unconscious WX who looks around the place as memories of their past begin overflowing through their systems. <br><br> We see these memories through a flashback sequence and here's where we learn that they were an inventor -presumably named Woodrow as the <a href='https://dontstarve.wiki.gg/images/thumb/WX-78_Sound_File_Woodrow_Prefixes.png/800px-WX-78_Sound_File_Woodrow_Prefixes.png?64f33d' style='color: #bb8354; text-decoration: underline;' target='_blank'>names in the audio files in the game</a> allow us to infer- once, a colleague of Robert Wagstaff with a peculiar dedication to experimenting in the field of mechanical prosthetics- one can assume this was in the hopes of developing what later would become their biggest (and dare I say most special) project: a complete robotic body that would act as a replacement for their own human body.<br><br>Our scientist would take notes and notice the animals they had modified, giving them mechanical prosthetic limbs; as a result these animals would react erratically and/or extremely irritable after the transplants. Yet our researcher dismissed this as being nothing but the organic component of the critters interfering. They persisted on their research with (most likely) the help of Wagstaff. After all, the scientist yearned to transcend the weakness of their own flesh by becoming metal- a soulless automaton, a machine devoid of the imperfections and weakness of the human condition.",
        "image": "WOODROW_MIND_TRANSFER.gif",
        "caption": "Goodbye,〚REDACTED〛. Hello, <s>world</s> WX-78.",
        "text2": "The experiment was, quoting their official Compendium entry, a〚RESOUNDING SUCCESS〛... or so they thought at first. <br><br> As we get to learn later on in the short, WX-78 kept working alongside Wagstaff to create a portal to The Constant (something that we will not discuss here, since that is an entirely different can of worms and it's mostly Wagstaff related), but as WX-78 worked, they kept getting glimpses of their old human self when they looked into reflective surfaces (as seen in the background gif here) or short flashes of imagery of their human hands. But how could this be? They were supposed to be perfect now. Without the weakness of their human flesh, WX-78 should be able to work without any complications. Once again, they blamed the organic component -this time their own- for the seeming imperfection in what should have been the perfect automaton body. Frustrated, they started designing new models that would not include an Empathy Module this time- WX blaming that for the permanence of their ability to feel. <br><br> A concerned Wagstaff tried to talk them out of this but it ony seemed to irritate the robot even more, throwing violently an object (which if we stop to look at it well, it appears to be a previous model of the Empathy Module) at their colleague. In the next frames, we see the new WX models that our automaton had been working on being thrown into a campfire by Wagstaff (which explains WX-78's in game quote \"IT REMINDS ME OF SOMETHING\" when they examine a campfire or a fire pit at normal fire levels). The constant flashing physical memories of the researcher's old body, the increasing violence and irritation in them and the growing tensions between them and their colleague ultimately led to Wagstaff sending them into The Constant via the portal they both had been working on together. <br><br> Back to the present day, we're shown a WX-78 who, clearly distressed by these unwanted memories, resorts to violently ripping out their own Empathy Module -to the horror of their fellow survivors- and crushing it to pieces, ensuring that these memories and their capacity to feel any sort of emotion -distress included- would be gone and buried for good.<br><br>Now that we know the context for their past, let's go over some stuff in the short that I believe are quite important.<br><br>As previously mentioned, WX-78 did experiments on animals which consisted in replacing their limbs for mechanical prosthetics, and as a result these animals would respond with erratic behavior.",
        "image2": "WOODROW_RESEARCH_NOTES.png",
        "caption2": "As seen in the image above (and as previously mentioned), WX-78 would blame this behavior on the organic component of the animals.",
        "text3": "With this knowledge, I think it's safe to say that the researcher missed a couple of important details about transplants of prosthetic limbs and eventually, about the consequences of fully \"trasferring\" their mind/consciousness to an entirely foreign, mechanical body. Let's look at the situation again from a medical perspective.<br><br>According to medical research about the side effects of acquiring a prosthetic limb after amputation, a creature's brain (be it an animal or a human) does not process the external limb as a part of their own body, but rather as a strange, invasive object and as a result the brain sends signals to the rest of the body that in turn will make it react physically and psychologically- one of the most common side effects is the development of phantom limb pain, where the brain continues to send signals to the amputated limb, causing intense pain and discomfort for a body part that is no longer there. This is a common condition in humans and animals alike, and it can be physically and mentally debilitating, causing irritation and erratic behavior.<br><br>Sounds familiar yet?<br><br>Let's move on onto the consequences of the mind transfer.",
        "image3": "WX-78_DISSOCIATION.gif",
        "caption3": "We can clearly appreciate how WX-78 is experiencing symptoms of dissociation as a result of the transfer to the robot body.",
        "text4": "WX-78 transferred their own mind/consciousness into the robotic body that we see up to the present day. And at first it seemed to be going well, the automaton being quite pleased with the result until things started to go south for them- experiencing flashes of their old self when looking at reflective surfaces or while working. They couldn't understand why would their new body and their \"CPU\" (aka their brain) experience these uncomfortable memories.<br><br>Instead of reasoning that perhaps it was a bad idea and that their mind was not processing the body as their own and in turn dissociating, they once more blamed the organic component- in this case, their emotions being the component that caused this \"system error\".<br><br>And in a way they were not entirely wrong this time, with their mind (and possibly, soul) being the organic component unable to process the automaton's body as their own- in a way it was the same issue explained as before, of a big, phantom limb pain.",
        "quote": "TOO LATE TOO LATE TOO LATE",
        "theme": "glitch",
        "alignment": "left"
    },
    {
        "id": "facade",
        "section": "analysis",
        "title": "The Performance of Evil",
        "subtitle": "MINOR SPOILERS AHEAD. They're not many but I should still warn you. Read under your own risk.",
        "text": "But are these memories and capacity for emotion really gone?<br><br>I don't think that's the case.<br><br> As we see in-game, WX-78 projects an image of a ruthless killing machine- as seen in many of their examination quotes and their interactions with organic creatures. The automaton claims to hate all living matter, constantly referring to organics as \"disgusting\" or \"inferior\".<br><br>But this is nothing but a facade. A performance to distance themselves from what they once were, and specially to distance themselves from their own emotions.<br><br>Don't believe me? Let's go over some of their quotes.",
        "quote2": "\"MY APPRECIATION FOR BEAUTY IS LIMITED\" - examining flowers.",
        "quote3": "\"AWW, IT'S JUST AS EVIL AS I AM.\" - examining a lureplant meat bulb.",
        "quote4": "\"I FEEL KINSHIP WITH THIS STRANGE ROOT\" - examining a potato.",
        "quote5": "\"A MINDLESS DRONE. I LIKE HIM.\" - examining a bee.",
        "quote6": "\"I GET ALONG WITH THIS ONE\" - examining a Beefalo (domesticated, ornery).",
        "text2": "<br>These are but a few examples of WX-78 clearly not being completely emotionless as they claim to be, or hating all organics/living matter as they say they do.<br><br><\"But what about the memories of their past life?\" - you might ask. Well, you're in for a treat! We have MORE quotes that definitely show us that our dear automaton still has at least one memory of their past life. They definitely remember Robert Wagstaff and the following quotes prove it. Let's check them out.",
        "quote7": "\"I WISH I COULD SEE THE OLD MAN'S FACE WHEN HE FINDS THOSE EMPTY CACHES\" - examining Inspectacles.",
        "quote8": "\"YOU.\" - examining the Grainy Transmission.",
        "quote9": "\"I'M NOT YOUR ASSISTANT OLD MAN.\" - examining the Grainy Transmission (after a mutated boss has been killed).",
        "text3": "<br>Sure, one could argue that they met Wagstaff in the Constant again and didn't remember him, therefore why they call him \"Old Man\" instead of Robert or Wagstaff. However, that \"YOU.\" feels very ominous in comparison to the other two, as if they were shocked to see him there. Why would they be shocked if they didn't know him? Unless they didn't want to remember him? And from checking the <a href='https://dontstarve.wiki.gg/wiki/Grainy_Transmission#Moonstorm-0' style='color: #bb8354; text-decoration: underline;' target='_blank'>other characters' examination quotes for the Grainy Transmission</a>, it's clear that the others -save for Maxwell, somehow- do not know who Robert Wagstaff is.<br><br>Still don't believe me? Very well! I still have three more quotes to show you.",
        "image": "WAGSTAFF_RELATED_QUOTES_COURTESY_OF_WAOKEVALE.png",
        "caption": "I have a limit to put 10 quotes per section and I already used 9 here so I couldn't add them as quotes per se, and I am NOT gonna edit the entire code again just to add 3 more quotes, I'm exhausted. Luckily for me, Waokevale's \"Why Wxwood works\" essay has exactly the three quotes I needed.",
        "quote": "HE JUST LEFT IT HERE. DISCARDED LIKE TRASH.",
        "theme": "evil?",
        "alignment": "right"
    },
    {
        "id": "hypocrisy",
        "section": "analysis",
        "title": "System Hypocrisy",
        "subtitle": "WARNING﹕In terms of coding, this assignment is finished and doesn't need much tweaking, which means it can be sent to our teacher now.\nThe bad news is that analysis-wise, this became way longer than I expected (perdón profe, es que me apasioné, es el autismo, usted entiéndame por favor) so I'm gonna have to send it the way it is right now and pray for the best. Sorry friends, you're gonna have to wait until I finish the semester. Thank you for your comprehension. and support.",
        "text": "For a robot who claims to hate organics, WX-78 is obsessed with mimicking them. They assign familial roles to machines, even going as far as giving their Bio Scanalyzer a nickname - calling the J1-M1 unit \"Jimmy\".<br><br>They crave validation and are deeply insecure within, wanting to be the subject of attention and the leader of 'minions'. They are vain, insecure, and deeply human in their flaws.",
        "quote": "ALWAYS REMEMBER YOU ARE BETTER THAN YOUR MAKERS, SISTER",
        "theme": "light",
        "alignment": "left"
    },
    {
        "id": "loneliness",
        "section": "analysis",
        "title": "The Solitude",
        "text": "Beneath the bravado lies a profound loneliness. WX-78 pushes others away out of paranoia and trust issues stemming from their past with Wagstaff.<br><br>They are terrified of vulnerability, yet they constantly seek connection, even if they frame it as 'enslavement' or 'minionhood'.",
        "quote": "FRIEND?",
        "theme": "trust-and-daddy-issues-they-just-like-me-fr",
        "alignment": "center"
    },
    {
        "id": "soft_spots",
        "section": "analysis",
        "title": "Glitches in the Programming",
        "text": "The 'Empathy Module' was never just a component; it was a symbol of their suppressed heart. WX-78 shows genuine fondness for 'mindless drones' (bees) and finds beauty in the inorganic.<br><br>But they also slip up. They find flowers beautiful. They protect their garden. The mask slips.",
        "quote": "WORMWOOD HAS A MEAN STREAK. HE IS GROWING ON ME",
        "theme": "nature-tech",
        "alignment": "right"
    },
    {
        "id": "connection",
        "section": "analysis",
        "title": "Capacity for Connection",
        "text": "Their relationship with entities like Wormwood proves that WX-78 is capable of genuine bond.<br><br>It is not about the other person; it is about WX-78 allowing themselves to be vulnerable, to accept care, and to protect something other than themselves. It is the ultimate proof that the 'soul' remains.",
        "quote": "MY PLANT MINION IS PROVING HIMSELF TO BE VERY USEFUL.",
        "theme": "nature-tech",
        "alignment": "left"
    },
    {
        "id": "conclusion",
        "section": "outro",
        "title": "Conclusion",
        "text": "WX-78 is a tragedy of their own making, a being running from their own nature.<br><br>They are not a monster. They are a defensive, lonely, and broken consciousness trying to survive in a world that reminds them of everything they lost.",
        "quote": "PRESSURE AND IMPURITIES HAVE PRODUCED PLEASING PERFECTION.",
        "theme": "conclusion",
        "alignment": "center"
    }
]